# RemoveRoofEdge

## Description
Function RemoveRoofEdge removes the specified roof edge from the referenced roof object.

```pascal
FUNCTION RemoveRoofEdge(
				roofObject : HANDLE;
				index      : INTEGER): BOOLEAN;
```

```python
def vs.RemoveRoofEdge(roofObject, index):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofObject|HANDLE|Handle to roof.|
|index|INTEGER|Index of roof edge to be removed.|

## Version
Availability: from VectorWorks8.0

## Category
* Objects - Roofs